cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'
tap 'caskroom/versions'

brew 'ack'
brew 'awscli'
brew 'coreutils'
brew 'go'
brew 'git'
brew 'git-extras'
brew 'grc'
brew 'grep'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'spark'
brew 'terraform'
brew 'trash'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask 'font-source-code-pro'
cask 'font-meslo-nerd-font'

cask 'alfred'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'postman'
cask 'skitch'
cask 'slack'
cask 'spectacle'
cask 'ubersicht'
cask 'visual-studio-code'
cask 'nordvpn'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'quicklook-csv'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
cask 'betterzip'
