cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'ack'
brew 'coreutils'
brew 'git'
brew 'git-extras'
brew 'grc'
brew 'grep'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'spark'
brew 'trash'
brew 'volta'
brew 'wget'
brew 'yarn'
brew 'yt-dlp'
brew 'zsh-syntax-highlighting'

cask 'font-caskaydia-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-source-code-pro'

cask 'firefox'
cask 'google-chrome'
cask 'hyper'
cask 'postman'
cask 'skitch'
cask 'slack'
cask 'spectacle'
cask 'visual-studio-code'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'quicklook-csv'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
