cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'caskroom/fonts'
tap 'caskroom/versions'

brew 'ack'
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'go'
brew 'git'
brew 'git-extras'
brew 'grc'
brew 'grep'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'spark'
brew 'trash'
brew 'unrar'
brew 'wget'
brew 'zsh'
brew 'z'

cask 'font-source-code-pro'
cask 'font-meslo-lg'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'gitkraken'
cask 'google-chrome'
cask 'iterm2-beta'
cask 'slack'
cask 'skitch'
cask 'spectacle'
cask 'sublime-text'
cask 'vlc'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
